{"application": "apache-commons-codec", "csha": "a011e57eb7b9fd47b33a582e0b59015b5eee7d72", "files": [{"BCodec_cluster": {"actions": [{"root": "UPDATE from value to strSource", "operations": ["UPD SimpleName: value from value to strSource", "UPD SimpleName: value from value to strSource", "UPD SimpleName: value from value to strSource", "UPD SimpleName: value from value to strSource", "UPD SimpleName: value from value to strSource", "UPD SimpleName: value from value to strSource", "UPD SimpleName: value from value to strSource", "UPD SimpleName: value from value to strSource", "UPD SimpleName: value from value to strSource", "UPD SimpleName: value from value to strSource", "UPD SimpleName: value from value to strSource", "UPD SimpleName: value from value to strSource"]}, {"root": "UPDATE from charset to sourceCharset", "operations": ["UPD SimpleName: charset from charset to sourceCharset", "UPD SimpleName: charset from charset to sourceCharset", "UPD SimpleName: charset from charset to sourceCharset", "UPD SimpleName: charset from charset to sourceCharset", "UPD SimpleName: charset from charset to sourceCharset", "UPD SimpleName: charset from charset to sourceCharset"]}, {"root": "UPDATE from The default charset used for string decoding and encoding. to The default Charset used for string decoding and encoding.", "operations": ["UPD TextElement: The default charset used for string decoding and encoding. from The default charset used for string decoding and encoding. to The default Charset used for string decoding and encoding."]}, {"root": "UPDATE from Constructor which allows for the selection of a default charset to Constructor which allows for the selection of a default Charset", "operations": ["UPD TextElement: Constructor which allows for the selection of a default charset from Constructor which allows for the selection of a default charset to Constructor which allows for the selection of a default Charset", "UPD TextElement: Constructor which allows for the selection of a default charset from Constructor which allows for the selection of a default charset to Constructor which allows for the selection of a default Charset"]}, {"root": "UPDATE from the default string charset to use. to the default string Charset to use.", "operations": ["UPD TextElement: the default string charset to use. from the default string charset to use. to the default string Charset to use."]}, {"root": "UPDATE from the default charset to use. to the default Charset to use.", "operations": ["UPD TextElement: the default charset to use. from the default charset to use. to the default Charset to use."]}, {"root": "UPDATE from If the named charset is unavailable to If the named Charset is unavailable", "operations": ["UPD TextElement: If the named charset is unavailable from If the named charset is unavailable to If the named Charset is unavailable"]}, {"root": "UPDATE from  1.7 throws UnsupportedCharsetException if the named charset is unavailable to  1.7 throws UnsupportedCharsetException if the named Charset is unavailable", "operations": ["UPD TextElement:  1.7 throws UnsupportedCharsetException if the named charset is unavailable from  1.7 throws UnsupportedCharsetException if the named charset is unavailable to  1.7 throws UnsupportedCharsetException if the named Charset is unavailable"]}, {"root": "UPDATE from Encodes a string into its Base64 form using the specified charset. Unsafe characters are escaped. to Encodes a string into its Base64 form using the specified Charset. Unsafe characters are escaped.", "operations": ["UPD TextElement: Encodes a string into its Base64 form using the specified charset. Unsafe characters are escaped. from Encodes a string into its Base64 form using the specified charset. Unsafe characters are escaped. to Encodes a string into its Base64 form using the specified Charset. Unsafe characters are escaped.", "UPD TextElement: Encodes a string into its Base64 form using the specified charset. Unsafe characters are escaped. from Encodes a string into its Base64 form using the specified charset. Unsafe characters are escaped. to Encodes a string into its Base64 form using the specified Charset. Unsafe characters are escaped."]}, {"root": "UPDATE from the charset for <code>value</code> to the Charset for <code>value</code>", "operations": ["UPD TextElement: the charset for <code>value</code> from the charset for <code>value</code> to the Charset for <code>value</code>", "UPD TextElement: the charset for <code>value</code> from the charset for <code>value</code> to the Charset for <code>value</code>"]}, {"root": "UPDATE from Encodes a string into its Base64 form using the default charset. Unsafe characters are escaped. to Encodes a string into its Base64 form using the default Charset. Unsafe characters are escaped.", "operations": ["UPD TextElement: Encodes a string into its Base64 form using the default charset. Unsafe characters are escaped. from Encodes a string into its Base64 form using the default charset. Unsafe characters are escaped. to Encodes a string into its Base64 form using the default Charset. Unsafe characters are escaped."]}, {"root": "UPDATE from Encodes an object into its Base64 form using the default charset. Unsafe characters are escaped. to Encodes an object into its Base64 form using the default Charset. Unsafe characters are escaped.", "operations": ["UPD TextElement: Encodes an object into its Base64 form using the default charset. Unsafe characters are escaped. from Encodes an object into its Base64 form using the default charset. Unsafe characters are escaped. to Encodes an object into its Base64 form using the default Charset. Unsafe characters are escaped."]}, {"root": "UPDATE from Gets the default charset name used for string decoding and encoding. to Gets the default Charset name used for string decoding and encoding.", "operations": ["UPD TextElement: Gets the default charset name used for string decoding and encoding. from Gets the default charset name used for string decoding and encoding. to Gets the default Charset name used for string decoding and encoding.", "UPD TextElement: Gets the default charset name used for string decoding and encoding. from Gets the default charset name used for string decoding and encoding. to Gets the default Charset name used for string decoding and encoding."]}, {"root": "UPDATE from  the default charset name to  the default Charset name", "operations": ["UPD TextElement:  the default charset name from  the default charset name to  the default Charset name", "UPD TextElement:  the default charset name from  the default charset name to  the default Charset name"]}]}}, {"BCodec_diff": {"operations": [" *          Header Extensions for Non-ASCII Text</a>(27) to TextElement:  <a href=\"http://www.ietf.org/rfc/rfc1522.txt\">MIME (Multipurpose Internet Mail Extensions) Part Two: Message", " *          Header Extensions for Non-ASCII Text</a>(27)", "Update SimpleName: value(200) to strSource", "Update SimpleName: charset(205) to sourceCharset", "Update SimpleName: value(244) to strSource", "Update SimpleName: charset(249) to sourceCharset", "Update SimpleName: value(305) to strSource", "Update TextElement: The default charset used for string decoding and encoding.(42) to The default Charset used for string decoding and encoding.", "Update TextElement: Constructor which allows for the selection of a default charset(61) to Constructor which allows for the selection of a default Charset", "Update TextElement: the default string charset to use.(64) to the default string Charset to use.", "Update TextElement: Constructor which allows for the selection of a default charset(86) to Constructor which allows for the selection of a default Charset", "Update TextElement: the default charset to use.(89) to the default Charset to use.", "Update TextElement: If the named charset is unavailable(92) to If the named Charset is unavailable", "Update TextElement:  1.7 throws UnsupportedCharsetException if the named charset is unavailable(94) to  1.7 throws UnsupportedCharsetException if the named Charset is unavailable", "Update TextElement: Encodes a string into its Base64 form using the specified charset. Unsafe characters are escaped.(177) to Encodes a string into its Base64 form using the specified Charset. Unsafe characters are escaped.", "Update SimpleName: value(179) to strSource", "Update SimpleName: charset(182) to sourceCharset", "Update TextElement: the charset for <code>value</code>(183) to the Charset for <code>value</code>", "Update TextElement: Encodes a string into its Base64 form using the specified charset. Unsafe characters are escaped.(223) to Encodes a string into its Base64 form using the specified Charset. Unsafe characters are escaped.", "Update SimpleName: value(225) to strSource", "Update SimpleName: charset(228) to sourceCharset", "Update TextElement: the charset for <code>value</code>(229) to the Charset for <code>value</code>", "Update TextElement: Encodes a string into its Base64 form using the default charset. Unsafe characters are escaped.(285) to Encodes a string into its Base64 form using the default Charset. Unsafe characters are escaped.", "Update SimpleName: value(287) to strSource", "Update TextElement: Encodes an object into its Base64 form using the default charset. Unsafe characters are escaped.(381) to Encodes an object into its Base64 form using the default Charset. Unsafe characters are escaped.", "Update TextElement: Gets the default charset name used for string decoding and encoding.(501) to Gets the default Charset name used for string decoding and encoding.", "Update TextElement:  the default charset name(503) to  the default Charset name", "Update TextElement: Gets the default charset name used for string decoding and encoding.(518) to Gets the default Charset name used for string decoding and encoding.", "Update TextElement:  the default charset name(520) to  the default Charset name", "Update SimpleName: value(209) to strSource", "Update SimpleName: value(217) to strSource", "Update SimpleName: charset(218) to sourceCharset", "Update SimpleName: value(253) to strSource", "Update SimpleName: value(309) to strSource", "Update SimpleName: value(317) to strSource", "Update SimpleName: value(262) to strSource", "Update SimpleName: charset(263) to sourceCharset"]}}], "commit_stats": [{"total_files": 1, "deleted_files": 0, "testing": "False", "maintenance": "False", "build": "False"}]}