{"application": "apache-commons-csv", "csha": "258387e3cee17b417149cd49c9fcea5b8105cf9b", "files": [{"CSVFormat_cluster": {"actions": [{"root": "UPDATE from Note that the comment introducer character is only recognised at the start of a line. to Note that the comment introducer character is only recognized at the start of a line.", "operations": ["UPD TextElement: Note that the comment introducer character is only recognised at the start of a line. from Note that the comment introducer character is only recognised at the start of a line. to Note that the comment introducer character is only recognized at the start of a line."]}, {"root": "UPDATE from Note that the comment start character is only recognised at the start of a line. to Note that the comment start character is only recognized at the start of a line.", "operations": ["UPD TextElement: Note that the comment start character is only recognised at the start of a line. from Note that the comment start character is only recognised at the start of a line. to Note that the comment start character is only recognized at the start of a line.", "UPD TextElement: Note that the comment start character is only recognised at the start of a line. from Note that the comment start character is only recognised at the start of a line. to Note that the comment start character is only recognized at the start of a line."]}]}}, {"CSVFormat_diff": {"operations": ["     *      http://dev.mysql.com/doc/refman/5.1/en/load-data.html</a>(372) to TextElement:  <a href=\"http://dev.mysql.com/doc/refman/5.1/en/load-data.html\">", "     *      http://dev.mysql.com/doc/refman/5.1/en/load-data.html</a>(372)", "Update TextElement: Note that the comment introducer character is only recognised at the start of a line.(1207) to Note that the comment introducer character is only recognized at the start of a line.", "Update TextElement: Note that the comment start character is only recognised at the start of a line.(1569) to Note that the comment start character is only recognized at the start of a line.", "Update TextElement: Note that the comment start character is only recognised at the start of a line.(1598) to Note that the comment start character is only recognized at the start of a line."]}}], "commit_stats": [{"total_files": 1, "deleted_files": 0, "testing": "False", "maintenance": "False", "build": "False"}]}