{"application": "apache-qpid-jms", "csha": "9d88cf840ba39bc9ce20d661090622939f78ca4f", "files": [{"JmsConnectionFactory_cluster": {"actions": [{"root": "UPDATE from  the username to  the user name used for connection authentication.", "operations": ["UPD TextElement:  the username from  the username to  the user name used for connection authentication."]}, {"root": "UPDATE from the username to set to the user name to set", "operations": ["UPD TextElement: the username to set from the username to set to the user name to set"]}, {"root": "UPDATE from  the password to  the password set for connection authentication.", "operations": ["UPD TextElement:  the password from  the password to  the password set for connection authentication."]}]}}, {"JmsConnectionFactory_diff": {"operations": ["Update TextElement:  the username(1308) to  the user name used for connection authentication.", "Update TextElement: the username to set(1322) to the user name to set", "Update TextElement:  the password(1340) to  the password set for connection authentication."]}}, {"JmsMessageProducer_cluster": {"actions": [{"root": "UPDATE from Implementation of a Jms MessageProducer to Implementation of a JMS MessageProducer", "operations": ["UPD TextElement: Implementation of a Jms MessageProducer from Implementation of a Jms MessageProducer to Implementation of a JMS MessageProducer"]}]}}, {"JmsMessageProducer_diff": {"operations": ["Update TextElement: Implementation of a Jms MessageProducer(42) to Implementation of a JMS MessageProducer"]}}, {"Provider_cluster": {"actions": [{"root": "UPDATE from cam be triggered to stop the resource generating new events or messages. to can be triggered to stop the resource generating new events or messages.", "operations": ["UPD TextElement: cam be triggered to stop the resource generating new events or messages. from cam be triggered to stop the resource generating new events or messages. to can be triggered to stop the resource generating new events or messages."]}]}}, {"Provider_diff": {"operations": ["Update TextElement: cam be triggered to stop the resource generating new events or messages.(177) to can be triggered to stop the resource generating new events or messages."]}}, {"AmqpAbstractResource_cluster": {"actions": [{"root": "UPDATE from When aborting the open operation, and there isnt an error condition, to When aborting the open operation, and there isn't an error condition,", "operations": ["UPD TextElement: When aborting the open operation, and there isnt an error condition, from When aborting the open operation, and there isnt an error condition, to When aborting the open operation, and there isn't an error condition,"]}, {"root": "UPDATE from A subclass may override this method to provide alternative behaviour. to A subclass may override this method to provide alternative behavior.", "operations": ["UPD TextElement: A subclass may override this method to provide alternative behaviour. from A subclass may override this method to provide alternative behaviour. to A subclass may override this method to provide alternative behavior."]}]}}, {"AmqpAbstractResource_diff": {"operations": ["Update TextElement: When aborting the open operation, and there isnt an error condition,(1106) to When aborting the open operation, and there isn't an error condition,", "Update TextElement: A subclass may override this method to provide alternative behaviour.(1108) to A subclass may override this method to provide alternative behavior."]}}, {"AmqpProvider_cluster": {"actions": []}}, {"AmqpProvider_diff": {"operations": []}}, {"AmqpSession_cluster": {"actions": []}}, {"AmqpSession_diff": {"operations": []}}, {"AmqpSupport_cluster": {"actions": []}}, {"AmqpSupport_diff": {"operations": []}}, {"FailoverProviderFactory_cluster": {"actions": [{"root": "UPDATE from Prefix addion used for all nested properties that should be applied to any remote URIs. to Prefix addition used for all nested properties that should be applied to any remote URIs.", "operations": ["UPD TextElement: Prefix addion used for all nested properties that should be applied to any remote URIs. from Prefix addion used for all nested properties that should be applied to any remote URIs. to Prefix addition used for all nested properties that should be applied to any remote URIs."]}]}}, {"FailoverProviderFactory_diff": {"operations": ["Update TextElement: Prefix addion used for all nested properties that should be applied to any remote URIs.(49) to Prefix addition used for all nested properties that should be applied to any remote URIs."]}}], "commit_stats": [{"total_files": 9, "deleted_files": 0, "testing": "True", "maintenance": "False", "build": "False"}]}