{"application": "apache-flume", "csha": "5e88a023abfc4edc5e3738f74ee51405fad66ac6", "files": [{"MemoryChannel_cluster": {"actions": [{"root": "MOVE from CompilationUnit", "operations": ["MOV ImportDeclaration to CompilationUnit at 1", "MOV ImportDeclaration to CompilationUnit at 1"]}, {"root": "UPDATE from Memory channel that with full transaction support to Memory channel that with full transaction support Uses transaction object for", "operations": ["UPD TextElement: Memory channel that with full transaction support from Memory channel that with full transaction support to Memory channel that with full transaction support Uses transaction object for"]}, {"root": "UPDATE from Uses transaction object for each thread (source and sink) attached to channel. to each thread (source and sink) attached to channel. The events are stored in", "operations": ["UPD TextElement: Uses transaction object for each thread (source and sink) attached to channel. from Uses transaction object for each thread (source and sink) attached to channel. to each thread (source and sink) attached to channel. The events are stored in"]}, {"root": "UPDATE from The events are stored in the thread safe Dequeue.  * The put and take are directly  to the thread safe Dequeue. * The put and take are directly executed in the", "operations": ["UPD TextElement: The events are stored in the thread safe Dequeue.  * The put and take are directly  from The events are stored in the thread safe Dequeue.  * The put and take are directly  to the thread safe Dequeue. * The put and take are directly executed in the"]}, {"root": "UPDATE from executed in the common queue. Channel has a marker for the last committed event in to common queue. Channel has a marker for the last committed event in order to", "operations": ["UPD TextElement: executed in the common queue. Channel has a marker for the last committed event in from executed in the common queue. Channel has a marker for the last committed event in to common queue. Channel has a marker for the last committed event in order to"]}, {"root": "UPDATE from order to avoid sink reading uncommitted data. to avoid sink reading uncommitted data. The transactions keep track of the", "operations": ["UPD TextElement: order to avoid sink reading uncommitted data. from order to avoid sink reading uncommitted data. to avoid sink reading uncommitted data. The transactions keep track of the"]}, {"root": "UPDATE from The transactions keep track of the actions to perform undo when rolled back. to actions to perform undo when rolled back.", "operations": ["UPD TextElement: The transactions keep track of the actions to perform undo when rolled back. from The transactions keep track of the actions to perform undo when rolled back. to actions to perform undo when rolled back."]}, {"root": "INS VariableDeclarationStatement to Block at 1", "operations": ["INS VariableDeclarationFragment to VariableDeclarationStatement at 1", "INS NullLiteral to VariableDeclarationFragment at 1", "INS SimpleName: capacity to VariableDeclarationFragment at 0", "INS VariableDeclarationStatement to Block at 1"]}, {"root": "UPDATE from Integer to String", "operations": ["UPD SimpleName: Integer from Integer to String", "UPD SimpleType: Integer from Integer to String"]}, {"root": "MOVE from VariableDeclarationStatement", "operations": ["MOV SimpleType: Integer to VariableDeclarationStatement at 0"]}, {"root": "INS Block to IfStatement at 2", "operations": ["INS Block to IfStatement at 2", "INS ExpressionStatement to Block at 0", "INS SimpleName: strCapacity to MethodInvocation at 2", "INS Assignment: = to ExpressionStatement at 0", "INS SimpleName: capacity to Assignment: = at 0", "INS SimpleName: Integer to MethodInvocation at 0", "INS SimpleName: parseInt to MethodInvocation at 1", "INS MethodInvocation to Assignment: = at 1"]}, {"root": "UPDATE from undo of put to undo of put for all the events in the undoPut queue, remove those from the", "operations": ["UPD TextElement: undo of put from undo of put to undo of put for all the events in the undoPut queue, remove those from the"]}, {"root": "UPDATE from for all the events in the undoPut queue, remove those from the event queue to event queue", "operations": ["UPD TextElement: for all the events in the undoPut queue, remove those from the event queue from for all the events in the undoPut queue, remove those from the event queue to event queue"]}, {"root": "UPDATE from undo of take operation to undo of take operation for each event in the undoTake list, add it back to", "operations": ["UPD TextElement: undo of take operation from undo of take operation to undo of take operation for each event in the undoTake list, add it back to"]}, {"root": "UPDATE from for each event in the undoTake list, add it back to the event queue to the event queue", "operations": ["UPD TextElement: for each event in the undoTake list, add it back to the event queue from for each event in the undoTake list, add it back to the event queue to the event queue"]}, {"root": "UPDATE from capacity to strCapacity", "operations": ["UPD SimpleName: capacity from capacity to strCapacity", "UPD SimpleName: capacity from capacity to strCapacity"]}, {"root": "INS SimpleType: String to TypeLiteral at 0", "operations": ["INS SimpleType: String to TypeLiteral at 0", "INS SimpleName: String to SimpleType: String at 0"]}]}}, {"MemoryChannel_diff": {"operations": ["Move ImportDeclaration(30) into CompilationUnit(981) at 1", "Move ImportDeclaration(32) into CompilationUnit(981) at 1", "Update TextElement: Memory channel that with full transaction support(47) to Memory channel that with full transaction support Uses transaction object for", "Update TextElement: Uses transaction object for each thread (source and sink) attached to channel.(48) to each thread (source and sink) attached to channel. The events are stored in", "Update TextElement: The events are stored in the thread safe Dequeue.  * The put and take are directly (49) to the thread safe Dequeue. * The put and take are directly executed in the", "Update TextElement: executed in the common queue. Channel has a marker for the last committed event in(50) to common queue. Channel has a marker for the last committed event in order to", "Update TextElement: order to avoid sink reading uncommitted data.(51) to avoid sink reading uncommitted data. The transactions keep track of the", "Update TextElement: The transactions keep track of the actions to perform undo when rolled back.(52) to actions to perform undo when rolled back.", "Insert VariableDeclarationStatement(512) into Block(559) at 1", "Update SimpleType: Integer(496) to String", "Move SimpleType: Integer(502) into VariableDeclarationStatement(512) at 0", "Insert VariableDeclarationFragment(511) into VariableDeclarationStatement(512) at 1", "Insert Block(528) into IfStatement(529) at 2", "Update TextElement: undo of put(626) to undo of put for all the events in the undoPut queue, remove those from the", "Update TextElement: for all the events in the undoPut queue, remove those from the event queue(627) to event queue", "Update TextElement: undo of take operation(810) to undo of take operation for each event in the undoTake list, add it back to", "Update TextElement: for each event in the undoTake list, add it back to the event queue(811) to the event queue", "Update SimpleName: Integer(495) to String", "Update SimpleName: capacity(497) to strCapacity", "Insert SimpleName: capacity(509) into VariableDeclarationFragment(511) at 0", "Insert NullLiteral(510) into VariableDeclarationFragment(511) at 1", "Update SimpleName: capacity(507) to strCapacity", "Insert ExpressionStatement(527) into Block(528) at 0", "Insert Assignment: =(526) into ExpressionStatement(527) at 0", "Insert SimpleType: String(502) into TypeLiteral(503) at 0", "Insert SimpleName: capacity(521) into Assignment: =(526) at 0", "Insert MethodInvocation(525) into Assignment: =(526) at 1", "Insert SimpleName: String(501) into SimpleType: String(502) at 0", "Insert SimpleName: Integer(522) into MethodInvocation(525) at 0", "Insert SimpleName: parseInt(523) into MethodInvocation(525) at 1", "Insert SimpleName: strCapacity(524) into MethodInvocation(525) at 2"]}}], "commit_stats": [{"total_files": 1, "deleted_files": 0, "testing": "False", "maintenance": "False", "build": "False"}]}