{"application": "apache-zookeeper", "csha": "31d99a300ad9b0c66905333c7775321a58345ed6", "files": [{"Election_cluster": {"actions": [{"root": "INS Javadoc to PackageDeclaration at 0", "operations": ["INS TextElement: \"License\"); you may not use this file except in compliance to TagElement at 5", "INS TextElement: See the License for the specific language governing permissions and to TagElement at 11", "INS TextElement: distributed with this work for additional information to TagElement at 2", "INS TextElement: regarding copyright ownership.  The ASF licenses this file to TagElement at 3", "INS TextElement: http://www.apache.org/licenses/LICENSE-2.0 to TagElement at 7", "INS TextElement: WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. to TagElement at 10", "INS TextElement: limitations under the License. to TagElement at 12", "INS Javadoc to PackageDeclaration at 0", "INS TextElement: or more contributor license agreements.  See the NOTICE file to TagElement at 1", "INS TextElement: distributed under the License is distributed on an \"AS IS\" BASIS, to TagElement at 9", "INS TextElement: with the License.  You may obtain a copy of the License at to TagElement at 6", "INS TextElement: Unless required by applicable law or agreed to in writing, software to TagElement at 8", "INS TagElement to Javadoc at 0", "INS TextElement: Licensed to the Apache Software Foundation (ASF) under one to TagElement at 0", "INS TextElement: to you under the Apache License, Version 2.0 (the to TagElement at 4"]}]}}, {"Election_diff": {"operations": ["Insert Javadoc(14) into PackageDeclaration(16) at 0", "Insert TagElement(13) into Javadoc(14) at 0", "Insert TextElement: Licensed to the Apache Software Foundation (ASF) under one(0) into TagElement(13) at 0", "Insert TextElement: or more contributor license agreements.  See the NOTICE file(1) into TagElement(13) at 1", "Insert TextElement: distributed with this work for additional information(2) into TagElement(13) at 2", "Insert TextElement: regarding copyright ownership.  The ASF licenses this file(3) into TagElement(13) at 3", "Insert TextElement: to you under the Apache License, Version 2.0 (the(4) into TagElement(13) at 4", "Insert TextElement: \"License\"); you may not use this file except in compliance(5) into TagElement(13) at 5", "Insert TextElement: with the License.  You may obtain a copy of the License at(6) into TagElement(13) at 6", "Insert TextElement: http://www.apache.org/licenses/LICENSE-2.0(7) into TagElement(13) at 7", "Insert TextElement: Unless required by applicable law or agreed to in writing, software(8) into TagElement(13) at 8", "Insert TextElement: distributed under the License is distributed on an \"AS IS\" BASIS,(9) into TagElement(13) at 9", "Insert TextElement: WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.(10) into TagElement(13) at 10", "Insert TextElement: See the License for the specific language governing permissions and(11) into TagElement(13) at 11", "Insert TextElement: limitations under the License.(12) into TagElement(13) at 12"]}}], "commit_stats": [{"total_files": 36, "deleted_files": 14, "testing": "True", "maintenance": "False", "build": "False"}]}