{"application": "apache-nutch", "csha": "21d56a0c5626553a3bf5058588d9277e6844e00f", "files": [{"Injector_cluster": {"actions": [{"root": "INS Javadoc to TypeDeclaration: class at 0", "operations": ["INS TextElement: <li>the CrawlDb seeds are injected into</li> to TagElement at 2", "INS TextElement: </ul> to TagElement at 5", "INS TextElement: InjectMapper reads to TagElement at 0", "INS TextElement: <ul> to TagElement at 1", "INS TextElement: metadata. Seed URLs are passed to the reducer with STATUS_INJECTED.</li> to TagElement at 4", "INS TextElement: Depending on configuration and command-line parameters the URLs are normalized to TagElement at 6", "INS Javadoc to TypeDeclaration: class at 0", "INS TextElement: <li>the plain-text seed files and parses each line into the URL and to TagElement at 3", "INS TextElement: and filtered using the configured plugins. to TagElement at 7", "INS TagElement to Javadoc at 0"]}, {"root": "INS TextElement: Injector takes a flat text file of URLs (or a folder containing text files) to TagElement at 0", "operations": ["INS TextElement: Injector takes a flat text file of URLs (or a folder containing text files) to TagElement at 0"]}, {"root": "UPDATE from Injector takes a flat file of URLs and merges (\"injects\") these URLs into the to and merges (\"injects\") these URLs into the CrawlDb. Useful for bootstrapping", "operations": ["UPD TextElement: Injector takes a flat file of URLs and merges (\"injects\") these URLs into the from Injector takes a flat file of URLs and merges (\"injects\") these URLs into the to and merges (\"injects\") these URLs into the CrawlDb. Useful for bootstrapping"]}, {"root": "UPDATE from CrawlDb. Useful for bootstrapping a Nutch crawl. The URL files contain one to a Nutch crawl. The URL files contain one URL per line, optionally followed by", "operations": ["UPD TextElement: CrawlDb. Useful for bootstrapping a Nutch crawl. The URL files contain one from CrawlDb. Useful for bootstrapping a Nutch crawl. The URL files contain one to a Nutch crawl. The URL files contain one URL per line, optionally followed by"]}, {"root": "UPDATE from URL per line, optionally followed by custom metadata separated by tabs with to custom metadata separated by tabs with the metadata key separated from the", "operations": ["UPD TextElement: URL per line, optionally followed by custom metadata separated by tabs with from URL per line, optionally followed by custom metadata separated by tabs with to custom metadata separated by tabs with the metadata key separated from the"]}, {"root": "UPDATE from the metadata key separated from the corresponding value by '='. to corresponding value by '='.", "operations": ["UPD TextElement: the metadata key separated from the corresponding value by '='. from the metadata key separated from the corresponding value by '='. to corresponding value by '='."]}, {"root": "UPDATE from Merge the input records as per rules below : to Merge the input records of one URL as per rules below :", "operations": ["UPD TextElement: Merge the input records as per rules below : from Merge the input records as per rules below : to Merge the input records of one URL as per rules below :"]}, {"root": "UPDATE from \"  <url_dir>\\tPath to directory with URL file(s) containing urls to be injected. A URL file\" to \"  <url_dir>\\tPath to URL file or directory with URL file(s) containing URLs to be injected.\"", "operations": ["UPD StringLiteral: \"  <url_dir>\\tPath to directory with URL file(s) containing urls to be injected. A URL file\" from \"  <url_dir>\\tPath to directory with URL file(s) containing urls to be injected. A URL file\" to \"  <url_dir>\\tPath to URL file or directory with URL file(s) containing URLs to be injected.\""]}, {"root": "UPDATE from \"           \\tshould have one URL per line, optionally followed by custom metadata.\" to \"           \\tA URL file should have one URL per line, optionally followed by custom metadata.\"", "operations": ["UPD StringLiteral: \"           \\tshould have one URL per line, optionally followed by custom metadata.\" from \"           \\tshould have one URL per line, optionally followed by custom metadata.\" to \"           \\tA URL file should have one URL per line, optionally followed by custom metadata.\""]}]}}, {"Injector_diff": {"operations": ["Insert Javadoc(186) into TypeDeclaration: class(875) at 0", "Insert TextElement: Injector takes a flat text file of URLs (or a folder containing text files)(86) into TagElement(107) at 0", "Update TextElement: Injector takes a flat file of URLs and merges (\"injects\") these URLs into the(86) to and merges (\"injects\") these URLs into the CrawlDb. Useful for bootstrapping", "Update TextElement: CrawlDb. Useful for bootstrapping a Nutch crawl. The URL files contain one(87) to a Nutch crawl. The URL files contain one URL per line, optionally followed by", "Update TextElement: URL per line, optionally followed by custom metadata separated by tabs with(88) to custom metadata separated by tabs with the metadata key separated from the", "Update TextElement: the metadata key separated from the corresponding value by '='.(89) to corresponding value by '='.", "Insert TagElement(185) into Javadoc(186) at 0", "Insert TextElement: InjectMapper reads(177) into TagElement(185) at 0", "Insert TextElement: <ul>(178) into TagElement(185) at 1", "Insert TextElement: <li>the CrawlDb seeds are injected into</li>(179) into TagElement(185) at 2", "Insert TextElement: <li>the plain-text seed files and parses each line into the URL and(180) into TagElement(185) at 3", "Insert TextElement: metadata. Seed URLs are passed to the reducer with STATUS_INJECTED.</li>(181) into TagElement(185) at 4", "Insert TextElement: </ul>(182) into TagElement(185) at 5", "Insert TextElement: Depending on configuration and command-line parameters the URLs are normalized(183) into TagElement(185) at 6", "Insert TextElement: and filtered using the configured plugins.(184) into TagElement(185) at 7", "Update TextElement: Merge the input records as per rules below :(985) to Merge the input records of one URL as per rules below :", "Update StringLiteral: \"  <url_dir>\\tPath to directory with URL file(s) containing urls to be injected. A URL file\"(1712) to \"  <url_dir>\\tPath to URL file or directory with URL file(s) containing URLs to be injected.\"", "Update StringLiteral: \"           \\tshould have one URL per line, optionally followed by custom metadata.\"(1717) to \"           \\tA URL file should have one URL per line, optionally followed by custom metadata.\""]}}], "commit_stats": [{"total_files": 1, "deleted_files": 0, "testing": "False", "maintenance": "False", "build": "False"}]}