{"application": "google-truth", "csha": "adad37e3b8cc0fc02a91923ce2f0e33ae8ca6f1b", "files": [{"MapSubject_cluster": {"actions": [{"root": "MOVE from TypeDeclaration: class", "operations": ["MOV MethodDeclaration to TypeDeclaration: class at 9"]}, {"root": "UPDATE from public to private", "operations": ["UPD Modifier: public from public to private"]}, {"root": "UPDATE from Attests that the map contains no entries, or fails. to Fails if the map is not empty.", "operations": ["UPD TextElement: Attests that the map contains no entries, or fails. from Attests that the map contains no entries, or fails. to Fails if the map is not empty."]}, {"root": "UPDATE from Attests that the map contains one or more entries, or fails. to Fails if the map is empty.", "operations": ["UPD TextElement: Attests that the map contains one or more entries, or fails. from Attests that the map contains one or more entries, or fails. to Fails if the map is empty."]}, {"root": "UPDATE from Attests that the map contains the given key. to Fails if the map does not contain the given key.", "operations": ["UPD TextElement: Attests that the map contains the given key. from Attests that the map contains the given key. to Fails if the map does not contain the given key.", "UPD TextElement: Attests that the map contains the given key or fails. from Attests that the map contains the given key or fails. to Fails if the map does not contain the given key."]}, {"root": "UPDATE from Attests that the map does not contain the given key. to Fails if the map contains the given key.", "operations": ["UPD TextElement: Attests that the map does not contain the given key. from Attests that the map does not contain the given key. to Fails if the map contains the given key.", "UPD TextElement: Attests that the map does not contain the given key or fails. from Attests that the map does not contain the given key or fails. to Fails if the map contains the given key."]}, {"root": "UPDATE from Attests that the map contains the given entry. to Fails if the map does not contain the given entry.", "operations": ["UPD TextElement: Attests that the map contains the given entry. from Attests that the map contains the given entry. to Fails if the map does not contain the given entry."]}, {"root": "UPDATE from Attests that the map does not contain the given entry. to Fails if the map contains the given entry.", "operations": ["UPD TextElement: Attests that the map does not contain the given entry. from Attests that the map does not contain the given entry. to Fails if the map contains the given entry."]}, {"root": "UPDATE from Attests that the map contains the given value for the given key. to Fails if the map does not contain the given value.", "operations": ["UPD TextElement: Attests that the map contains the given value for the given key. from Attests that the map contains the given value for the given key. to Fails if the map does not contain the given value."]}]}}, {"MapSubject_diff": {"operations": ["Move MethodDeclaration(497) into TypeDeclaration: class(498) at 9", "Update Modifier: public(55) to private", "Update TextElement: Attests that the map contains no entries, or fails.(70) to Fails if the map is not empty.", "Update TextElement: Attests that the map contains one or more entries, or fails.(89) to Fails if the map is empty.", "Update TextElement: Attests that the map contains the given key.(107) to Fails if the map does not contain the given key.", "Update TextElement: Attests that the map does not contain the given key.(132) to Fails if the map contains the given key.", "Update TextElement: Attests that the map contains the given entry.(156) to Fails if the map does not contain the given entry.", "Update TextElement: Attests that the map does not contain the given entry.(202) to Fails if the map contains the given entry.", "Update TextElement: Attests that the map contains the given key or fails.(247) to Fails if the map does not contain the given key.", "Update TextElement: Attests that the map does not contain the given key or fails.(353) to Fails if the map contains the given key.", "Update TextElement: Attests that the map contains the given value for the given key.(410) to Fails if the map does not contain the given value."]}}], "commit_stats": [{"total_files": 1, "deleted_files": 0, "testing": "False", "maintenance": "False", "build": "False"}]}