{"application": "google-guava", "csha": "f38aa29944527b56013694ab4751f99abca463af", "files": [{"Files_cluster": {"actions": [{"root": "UPDATE from Moves the file from one path to another. This method can rename a file or to Moves a file from one path to another. This method can rename a file", "operations": ["UPD TextElement: Moves the file from one path to another. This method can rename a file or from Moves the file from one path to another. This method can rename a file or to Moves a file from one path to another. This method can rename a file"]}, {"root": "UPDATE from move it to a different directory, like the Unix  to and/or move it to a different directory. In either case ", "operations": ["UPD TextElement: move it to a different directory, like the Unix  from move it to a different directory, like the Unix  to and/or move it to a different directory. In either case "]}, {"root": "UPDATE from  command. to  must", "operations": ["UPD TextElement:  command. from  command. to  must"]}, {"root": "INS TextElement: be the target path for the file itself; not just the new name for the to TagElement at 4", "operations": ["INS TextElement: be the target path for the file itself; not just the new name for the to TagElement at 4"]}, {"root": "INS TextElement: file or the path to the new parent directory. to TagElement at 5", "operations": ["INS TextElement: file or the path to the new parent directory. to TagElement at 5"]}, {"root": "UPDATE from  mv to  to", "operations": ["UPD TextElement:  mv from  mv to  to"]}]}}, {"Files_diff": {"operations": ["Update TextElement: Moves the file from one path to another. This method can rename a file or(1990) to Moves a file from one path to another. This method can rename a file", "Update TextElement: move it to a different directory, like the Unix (1991) to and/or move it to a different directory. In either case ", "Update TextElement:  command.(1994) to  must", "Insert TextElement: be the target path for the file itself; not just the new name for the(1995) into TagElement(1997) at 4", "Insert TextElement: file or the path to the new parent directory.(1996) into TagElement(1997) at 5", "Update TextElement:  mv(1992) to  to"]}}], "commit_stats": [{"total_files": 1, "deleted_files": 0, "testing": "False", "maintenance": "False", "build": "False"}]}